### Import DATA

In [1]:
import pandas as pd

In [2]:
groups1_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/groups1.csv')
groups2_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/groups2.csv')
categories_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/categories.csv')
cities_df = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Meetup/cities.csv', dtype={'zip': 'string'})

In [3]:
print("Groups 1 DataFrame:")
groups1_df.head()

Groups 1 DataFrame:

   group_id                           name  category_id  city_id
0      6388         Alternative Health NYC           14    10001
1      6510      Alternative Energy Meetup            4    10001
2      8458              NYC Animal Rights           26    10001
3      8940  The New York City Anime Group           29    10001
4     10104             NYC Pit Bull Group           26    10001

In [4]:
print("Groups 2 DataFrame:")
groups2_df.head()

Groups 2 DataFrame:

,group_id,name,category_id,city_id
0,18879327,BachataMania,5,10001
1,18880221,Photoshoot Chicago - Photography and Modeling ...,27,60601
2,18880426,Chicago Adult Push / Kick Scooter Group Riding...,31,60601
3,18880495,Chicago International Soccer Club,32,60601
4,18880695,Impact.tech San Francisco Meetup,2,94101

In [5]:
print("Categories DataFrame:")
categories_df.head()

Categories DataFrame:

   category_id            category_name
0            1           Arts & Culture
1            3       Cars & Motorcycles
2            4  Community & Environment
3            5                  Dancing
4            6     Education & Learning

In [6]:
print("Cities DataFrame:")
cities_df.head()

Cities DataFrame:

      id            city state    zip
0   7093   West New York    NJ  07093
1  10001        New York    NY  10001
2  13417  New York Mills    NY  13417
3  46312    East Chicago    IN  46312
4  56567  New York Mills    MN  56567

### Concatenating Data Sets

In [7]:
groups = pd.concat([groups1_df, groups2_df], ignore_index=True)
groups.shape

(16330, 4)

In [8]:
len(groups1_df) + len(groups2_df)

16330

In [9]:
print(pd.concat([groups1_df, groups2_df],keys=['group1','group2']))

             group_id                                               name  \
group1 0         6388                             Alternative Health NYC
       1         6510                          Alternative Energy Meetup
       2         8458                                  NYC Animal Rights
       3         8940                      The New York City Anime Group
       4        10104                                 NYC Pit Bull Group
...               ...                                                ...
group2 8326  26377464                                            Shinect
       8327  26377698  The art of getting what you want [conference s...
       8328  26378067                        Streeterville Running Group
       8329  26378128                                     Just Dance NYC
       8330  26378470           FREE Arabic Chicago Evanston North Burbs

             category_id  city_id
group1 0              14    10001
       1               4    10001
       2              26    10001
       3              29    10001
       4              26    10001
...                  ...      ...
group2 8326           34    94101
       8327           14    94101
       8328            9    60601
       8329           23    10001
       8330           31    60601

[16330 rows x 4 columns]

In [10]:
pd.concat([groups1_df, groups2_df],keys=['group1','group2'])

             group_id                                               name  \
group1 0         6388                             Alternative Health NYC
       1         6510                          Alternative Energy Meetup
       2         8458                                  NYC Animal Rights
       3         8940                      The New York City Anime Group
       4        10104                                 NYC Pit Bull Group
...               ...                                                ...
group2 8326  26377464                                            Shinect
       8327  26377698  The art of getting what you want [conference s...
       8328  26378067                        Streeterville Running Group
       8329  26378128                                     Just Dance NYC
       8330  26378470           FREE Arabic Chicago Evanston North Burbs

             category_id  city_id
group1 0              14    10001
       1               4    10001
       2              26    10001
       3              29    10001
       4              26    10001
...                  ...      ...
group2 8326           34    94101
       8327           14    94101
       8328            9    60601
       8329           23    10001
       8330           31    60601

[16330 rows x 4 columns]

### Missing Values in Combined DataFrames

In [11]:
sports_champions_A = pd.DataFrame(
data = [
["New England Patriots", "Houston Astros"],
["Philadelphia Eagles", "Boston Red Sox"]
],
columns = ["Football", "Baseball"],
index = [2017, 2018]
)

In [12]:
sports_champions_B = pd.DataFrame(
data = [
["New England Patriots", "St. Louis Blues"],
["Kansas City Chiefs", "Tampa Bay Lightning"]
],
columns = ["Football", "Hockey"],
index = [2019, 2020]
)

**Try to concatenate and observe NaN values at the intersection of rows and columns that are not common to the source datasets**

In [13]:
pd.concat(objs = [sports_champions_A, sports_champions_B])

                  Football        Baseball               Hockey
2017  New England Patriots  Houston Astros                  NaN
2018   Philadelphia Eagles  Boston Red Sox                  NaN
2019  New England Patriots             NaN      St. Louis Blues
2020    Kansas City Chiefs             NaN  Tampa Bay Lightning

**By default, pandas performs the concatenation of horizontal lines. However, sometimes it is preferable to concatenate vertically.**

In [14]:
sports_champions_C = pd.DataFrame(
data = [
["Pittsburgh Penguins", "Golden State Warriors"],
["Washington Capitals", "Golden State Warriors"]
],
columns = ["Hockey", "Basketball"],
index = [2017, 2018]
)
sports_champions_C

                   Hockey             Basketball
2017  Pittsburgh Penguins  Golden State Warriors
2018  Washington Capitals  Golden State Warriors

**By horizontal**

In [15]:
pd.concat(objs = [sports_champions_A, sports_champions_C])

,Football,Baseball,Hockey,Basketball
2017,New England Patriots,Houston Astros,NaN,NaN
2018,Philadelphia Eagles,Boston Red Sox,NaN,NaN
2017,NaN,NaN,Pittsburgh Penguins,Golden State Warriors
2018,NaN,NaN,Washington Capitals,Golden State Warriors

**By vertical**

In [16]:
pd.concat(objs = [sports_champions_A, sports_champions_C], axis = 'columns')

,Football,Baseball,Hockey,Basketball
2017,New England Patriots,Houston Astros,Pittsburgh Penguins,Golden State Warriors
2018,Philadelphia Eagles,Boston Red Sox,Washington Capitals,Golden State Warriors

### Left Joins

In [17]:
groups.head(3)

   group_id                       name  category_id  city_id
0      6388     Alternative Health NYC           14    10001
1      6510  Alternative Energy Meetup            4    10001
2      8458          NYC Animal Rights           26    10001

In [18]:
categories_df.head(3)

   category_id            category_name
0            1           Arts & Culture
1            3       Cars & Motorcycles
2            4  Community & Environment

In [19]:
groups.merge(categories_df, how = 'left', on = 'category_id').head()

,group_id,name,category_id,city_id,category_name
0,6388,Alternative Health NYC,14,10001,Health & Wellbeing
1,6510,Alternative Energy Meetup,4,10001,Community & Environment
2,8458,NYC Animal Rights,26,10001,NaN
3,8940,The New York City Anime Group,29,10001,Sci-Fi & Fantasy
4,10104,NYC Pit Bull Group,26,10001,NaN

In [20]:
groups.merge(categories_df, how='left', left_on='category_id', right_on='category_id').head()

,group_id,name,category_id,city_id,category_name
0,6388,Alternative Health NYC,14,10001,Health & Wellbeing
1,6510,Alternative Energy Meetup,4,10001,Community & Environment
2,8458,NYC Animal Rights,26,10001,NaN
3,8940,The New York City Anime Group,29,10001,Sci-Fi & Fantasy
4,10104,NYC Pit Bull Group,26,10001,NaN

### Inner join

In [21]:
groups.merge(categories_df, how = "inner", on = "category_id").head()

,group_id,name,category_id,city_id,category_name
0,6388,Alternative Health NYC,14,10001,Health & Wellbeing
1,6510,Alternative Energy Meetup,4,10001,Community & Environment
2,8940,The New York City Anime Group,29,10001,Sci-Fi & Fantasy
3,10359,NYC International Arabic Language & Culture Club,16,10001,Language & Ethnic Identity
4,12111,The New York City American Sign Language Meetu...,16,10001,Language & Ethnic Identity

In [22]:
groups[groups["category_id"] == 14]

,group_id,name,category_id,city_id
0,6388,Alternative Health NYC,14,10001
52,54126,Energy Healers NYC,14,10001
78,67776,Flourishing Life Meetup,14,10001
121,111855,Hypnosis & NLP NYC - Update Your Brain,14,10001
136,129277,The Live Food Chicago Community,14,60601
...,...,...,...,...
16174,26291539,The Transformation Project: Collaborative Life...,14,94101
16201,26299876,"Cognitive Empathy, How To Translate Enemy Imag...",14,10001
16248,26322976,Contemplative Practices Group,14,94101
16314,26366221,The art of getting what you want: hacking fear,14,94101
16326,26377698,The art of getting what you want [conference s...,14,94101

In [23]:
categories_df[categories_df["category_id"] == 14]

   category_id       category_name
8           14  Health & Wellbeing

### Outer join

In [24]:
groups.head(3)

   group_id                       name  category_id  city_id
0      6388     Alternative Health NYC           14    10001
1      6510  Alternative Energy Meetup            4    10001
2      8458          NYC Animal Rights           26    10001

In [25]:
cities_df.head(3)

      id            city state    zip
0   7093   West New York    NJ  07093
1  10001        New York    NY  10001
2  13417  New York Mills    NY  13417

In [26]:
groups.merge(cities_df, how='outer', left_on='city_id', right_on='id').tail()

,group_id,name,category_id,city_id,id,city,state,zip
16329,26373602.0,Earndotcom: SF's most awesome digital currency...,34.0,94101.0,94101,San Francisco,CA,94101
16330,26374655.0,Vocabulary workhop,16.0,94101.0,94101,San Francisco,CA,94101
16331,26377464.0,Shinect,34.0,94101.0,94101,San Francisco,CA,94101
16332,26377698.0,The art of getting what you want [conference s...,14.0,94101.0,94101,San Francisco,CA,94101
16333,NaN,NaN,NaN,NaN,95712,Chicago Park,CA,95712

**indicator True will add a column _merge with values "both", "left_only" Ð¸ "right_only":**

In [27]:
groups.merge(cities_df, how='outer', left_on='city_id', right_on='id', indicator=True).tail()

,group_id,name,category_id,city_id,id,city,state,zip,_merge
16329,26373602.0,Earndotcom: SF's most awesome digital currency...,34.0,94101.0,94101,San Francisco,CA,94101,both
16330,26374655.0,Vocabulary workhop,16.0,94101.0,94101,San Francisco,CA,94101,both
16331,26377464.0,Shinect,34.0,94101.0,94101,San Francisco,CA,94101,both
16332,26377698.0,The art of getting what you want [conference s...,14.0,94101.0,94101,San Francisco,CA,94101,both
16333,NaN,NaN,NaN,NaN,95712,Chicago Park,CA,95712,right_only

**Returns only right_only values**

In [28]:
outer_join = groups.merge(
cities_df,
how = "outer",
left_on = "city_id",
right_on = "id",
indicator = True
)
in_right_only = outer_join["_merge"] == "right_only"
outer_join[in_right_only].head()

,group_id,name,category_id,city_id,id,city,state,zip,_merge
8576,NaN,NaN,NaN,NaN,13417,New York Mills,NY,13417,right_only
8577,NaN,NaN,NaN,NaN,46312,East Chicago,IN,46312,right_only
8578,NaN,NaN,NaN,NaN,56567,New York Mills,MN,56567,right_only
16333,NaN,NaN,NaN,NaN,95712,Chicago Park,CA,95712,right_only

### Merging on Index Labels

In [29]:
cities_df.head(3)

      id            city state    zip
0   7093   West New York    NJ  07093
1  10001        New York    NY  10001
2  13417  New York Mills    NY  13417

In [30]:
cities_df.set_index("id", inplace=True)

In [31]:
cities_df.head(3)

                 city state    zip
id
7093    West New York    NJ  07093
10001        New York    NY  10001
13417  New York Mills    NY  13417

In [32]:
groups.head(3)

   group_id                       name  category_id  city_id
0      6388     Alternative Health NYC           14    10001
1      6510  Alternative Energy Meetup            4    10001
2      8458          NYC Animal Rights           26    10001

**right_index = True. This argument tells pandas that matches city_id in the right-hand set data it should search in its index**

In [33]:
groups.merge(cities_df, how='left', left_on='city_id', right_index=True).head()

,group_id,name,category_id,city_id,city,state,zip
0,6388,Alternative Health NYC,14,10001,New York,NY,10001
1,6510,Alternative Energy Meetup,4,10001,New York,NY,10001
2,8458,NYC Animal Rights,26,10001,New York,NY,10001
3,8940,The New York City Anime Group,29,10001,New York,NY,10001
4,10104,NYC Pit Bull Group,26,10001,New York,NY,10001

**The merge method also has an additional left_index parameter.**

### Task

In [34]:
week1  = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Restaurant/week_1_sales.csv')
week2  = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Restaurant/week_2_sales.csv')
customers = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Restaurant/customers.csv', index_col='ID')
food  = pd.read_csv('/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 10 Merge Join Concat/Data/Restaurant/foods.csv', index_col='Food ID')

#### Combine two-week sales data into one DataFrame. Assign The week1 key is "Week 1", and the week2 key is "Week 2".

In [35]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [36]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [37]:
print(pd.concat([week1, week2],keys=['week1','week2']))

           Customer ID  Food ID
week1 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

#### Find customers who have been to the restaurant at each review weeks.

In [38]:
week2.merge(week1, how='inner', on='Customer ID').head()

   Customer ID  Food ID_x  Food ID_y
0          189          5          4
1          310          5          2
2          310          5          1
3          761          2          9
4          741          8          3

**Remove duplicates**

In [39]:
week1.merge(week2, how='inner', on='Customer ID').drop_duplicates(subset=['Customer ID']).head()

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          503          5          8
5          550          6          7
6          101          7          4

#### Find customers who have been to the restaurant on each of the week and every week ordered the same dish.

In [40]:
week1.merge(week2, how='inner', on=['Customer ID','Food ID']).head()

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4

#### Find customers who visited the restaurant only in the first week and only the second week.

In [45]:
week1.merge(right = week2, how='outer', on=['Customer ID'], indicator=True).head()

   Customer ID  Food ID_x  Food ID_y      _merge
0            3        2.0        NaN   left_only
1            8        NaN        6.0  right_only
2           10        2.0        NaN   left_only
3           13        NaN        2.0  right_only
4           20        1.0        NaN   left_only

#### Add customers' information from the first week who ordered a dish.

In [48]:
customers.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [52]:
week1.merge(right=customers, how='left', left_on=['Customer ID'], right_on=['ID'], right_index=True).head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III